Diplom-Project/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

Diplom-Project/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Diplom-Project/src/CommonModules/ВКМ_ПроверкаДанныхДокумента/Module.bsl
#Область ПрограммныйИнтерфейс

// Получить данные договора.
// 
// Параметры:
//  ДатаДокумента - Дата - Дата документа
//  ДоговорСсылка - СправочникСсылка.ДоговорыКонтрагентов - Договор ссылка
// 
// Возвращаемое значение:
//  Структура -  Получить данные договора:
// * ЭтоАбонентскоеОбслуживание - Булево - 
// * ЭтоДействующийДоговор - Булево - 
Функция ПолучитьДанныеДоговора(ДатаДокумента, ДоговорСсылка) Экспорт
	
	// Проверка вида договора
	ДанныеДоговора = Новый Структура;
	
	//@skip-check wrong-string-literal-content
	ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорСсылка, "ВидДоговора");
	АбонентскоеОбслуживание = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание;
	
	Если ВидДоговора = АбонентскоеОбслуживание Тогда
		ДанныеДоговора.Вставить("ЭтоАбонентскоеОбслуживание", Истина);
	Иначе
		ДанныеДоговора.Вставить("ЭтоАбонентскоеОбслуживание", Ложь);
	КонецЕсли;
	
	// Проверка действия договора
	Выборка = ПолучитьДанные_ПериодДоговора(ДатаДокумента, ДоговорСсылка);
	
	Если Выборка.Следующий() Тогда
		ДанныеДоговора.Вставить("ЭтоДействующийДоговор", Истина);
	Иначе
		ДанныеДоговора.Вставить("ЭтоДействующийДоговор", Ложь);
	КонецЕсли;
	
	Возврат ДанныеДоговора;
	
КонецФункции

// Получить константы номенклатуры.
// 
// Возвращаемое значение:
//  Структура -  Получить константы номенклатуры:
// * ЕстьКонстантыНоменклатуры - Булево - 
Функция ПолучитьКонстантыНоменклатуры() Экспорт
	
	ДанныеКонстант = Новый Структура;
	
	// Проверка заполнения констант номенклатуры
	НоменклатураАбонентскаяПлата = ПолучитьНоменклатуруАбонентскаяПлата();
	НоменклатураРаботыСпециалиста = ПолучитьНоменклатуруРаботыСпециалиста();
	
	Если ЗначениеЗаполнено(НоменклатураАбонентскаяПлата) И ЗначениеЗаполнено(НоменклатураРаботыСпециалиста) Тогда
		ДанныеКонстант.Вставить("ЕстьКонстантыНоменклатуры", Истина);
		ДанныеКонстант.Вставить("НоменклатураАбонентскаяПлата", НоменклатураАбонентскаяПлата);
		ДанныеКонстант.Вставить("НоменклатураРаботыСпециалиста", НоменклатураРаботыСпециалиста);
	Иначе
		ДанныеКонстант.Вставить("ЕстьКонстантыНоменклатуры", Ложь)
	КонецЕсли;
	
	Возврат ДанныеКонстант;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ДанныеДоговора

Функция ПолучитьДанные_ПериодДоговора(ДатаДокумента, ДоговорСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора КАК ДатаНачалаДействияДоговора,
	|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора КАК ДатаОкончанияДействияДоговора
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &ДоговорСсылка
	|	И &ДатаДокумента МЕЖДУ ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора";
	
	Запрос.УстановитьПараметр("ДоговорСсылка", ДоговорСсылка);
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
	
КонецФункции

#КонецОбласти

#Область КонстантыНоменклатуры

Функция ПолучитьНоменклатуруАбонентскаяПлата()
	
	НоменклатураАбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	
	Возврат НоменклатураАбонентскаяПлата;
	
КонецФункции

Функция ПолучитьНоменклатуруРаботыСпециалиста()
	
	НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	
	Возврат НоменклатураРаботыСпециалиста;
	
КонецФункции

#КонецОбласти

#КонецОбласти
